[
  {
    "id": 1,
    "author": "bsullivan0",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Captain America: Civil War Review",
    "gender": "Male",
    "publishedDate": "2015-08-27T00:07:14Z",
    "likes": 921,
    "starts": 1,
    "abstract": "Political pressure mounts to install a system of accountability when the actions of the Avengers lead to collateral damage. The new status quo deeply divides members of the team. Captain America (Chris Evans) believes superheroes should remain free to defend humanity without government interference. Iron Man (Robert Downey Jr.) sharply disagrees and supports oversight. As the debate escalates into an all-out feud, Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner) must pick a side.",
    "images": [      
        "http://themovieblog.com/wp-content/uploads/2016/05/captain_america_civil_war-752x440.jpg", 
        "http://themovieblog.com/wp-content/uploads/2016/03/Captain-America-Civil-War-Trailer-2-35-1280x531-594x246.jpg"
    ],
    "body": "<p><iframe width='747' height=\"420\" src=\"https:\/\/www.youtube.com\/embed\/QGfhS1hfTWw?feature=oembed\" frameborder=\"0\" allowfullscreen><\/iframe><\/p> <h2>The General Idea<\/h2> <blockquote><p>Political pressure mounts to install a system of accountability when the actions of the Avengers lead to collateral damage. The new status quo deeply divides members of the team. Captain America (Chris Evans) believes superheroes should remain free to defend humanity without government interference.<span class=\"_dgc\"> Iron Man (Robert Downey Jr.) sharply disagrees and supports oversight. As the debate escalates into an all-out feud, Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner) must pick a side.<\/span><\/p><\/blockquote> <h2>The Good<\/h2> <p>This movie starts at full speed throwing the audience into the surprisingly intricate story without any warning. What I mean by this is that Civil War opens without any credit sequence, Marvel logo, or fun soundtrack to ease you into the chaos that unfolds. Instead this movie throws you right in and trusts that you&#8217;ll stay afloat from the onset. Once the credits actually roll we&#8217;re treated to a scene that both made me wonder how they stuck a young Ferris Bueller in my Marvel film and what sort of devilish deal was bartered to get RDJ seem so young. Like, seriously, this moment was utterly shocking!<\/p> <p>The plot of this movie is <a href=\"http:\/\/www.themovieblog.com\/2016\/batman-v-superman-dawn-of-justice-review\/\">similar to other super hero movies<\/a> but this movie finds a way to set itself apart with the attention and care of the characters themselves. The less you know about the plot the better but the conclusion of this movie ensures that the heroes in this movie don&#8217;t walk away from this film with relationships unscathed. There are ramifications to the relationships that will likely carry on in future films. Civil War initially gave me some bad Age of Ultron vibes with The   Avengers encroaching a mission without any backstory. Those concerns began to wash away when the film took it upon itself to remind me that this is the Russo&#8217;s we&#8217;re talking about and their concept of action is a lot more grounded and brutal than what we see in other Marvel films. This is a deliberate introduction that has a purpose that you&#8217;ll understand as the movie progresses. The movie may begin with action but the action sequences are so good that they seem like they were lifted directly from a great Jason Bourne movie and Marvel has no business having sequences this well thought out or fun.<\/p> <p><a href=\"http:\/\/www.themovieblog.com\/2016\/captain-america-civil-war-official-trailer-2\/captain-america-civil-war-trailer-2-35-1280x531\/\" rel=\"attachment wp-att-935199\"><img class=\"aligncenter size-medium wp-image-935199\" src=\"http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/03\/Captain-America-Civil-War-Trailer-2-35-1280x531-594x246.jpg\" alt=\"Captain-America-Civil-War-Trailer-2-35-1280x531\" width=\"594\" height=\"246\" srcset=\"http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/03\/Captain-America-Civil-War-Trailer-2-35-1280x531-594x246.jpg 594w, http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/03\/Captain-America-Civil-War-Trailer-2-35-1280x531-768x319.jpg 768w, http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/03\/Captain-America-Civil-War-Trailer-2-35-1280x531-1024x425.jpg 1024w, http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/03\/Captain-America-Civil-War-Trailer-2-35-1280x531.jpg 1280w\" sizes=\"(max-width: 594px) 100vw, 594px\" \/><\/a><\/p><p>Civil War has an ebb and flow approach to story pacing, which I appreciated and although there are times that I felt bombarded with characters at such a fast pace that I almost got worried that I would get lost in everything presented on screen but that wasn&#8217;t the case. Civil War introduces the Black Panther to the Marvel cinematic universe and good GOD does he do debut in spectacular fashion. We get our first look at the Panther in full garb in the middle of an action scene but he somehow does not get overshadowed by the chaos. In fact, T&#8217;Challa regularly arrests your attention and steals scenes whenever he was on screen regardless of whether he was in costume. His debut is a remarkable success and a huge credit to the Russo&#8217;s for providing us a wonderful take on the character. Black Panther is most definitely not an Avenger and has his own agenda that he carries throughout the film until its resolution. I was initially concerned about how Black Panther would be portrayed but he quickly made a fantastic impression and rose to one of my new top 3 favorite Avengers along with Captain America and Spider-Man. He&#8217;s such a powerful on-screen presence that I expect Black Panther to be a household name before Civil War&#8217;s theatrical run is completed.<\/p><p><a href=\"http:\/\/www.themovieblog.com\/2016\/captain-america-civil-war-official-trailer-2\/captain-america-civil-war-trailer-2-38-1280x531\/\" rel=\"attachment wp-att-935197\"><img class=\"alignleft size-thumbnail wp-image-935197\" src=\"http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/03\/Captain-America-Civil-War-Trailer-2-38-1280x531-291x161.jpg\" alt=\"Captain-America-Civil-War-Trailer-2-38-1280x531\" width=\"291\" height=\"161\" \/><\/a>Speaking of Spider-Man, this latest iteration of the wall crawler is <em>pure<\/em> cinematic joy. Spidey pops up, spits some nerdy witty quips and then exits as abruptly as he appears but his moments pretty Amazing. Tom Holland does a great job portraying Spider-Man and there are some obvious hints of inspiration from both Tobey Maguire&#8217;s and Andrew Garfields portrayals of Spider-Man Holland seems to adopt the best parts of both performances to create a beautiful blend of a 15 year old Spider-boy&#8230;guy&#8230; MAN! Spider-MAN! I enjoyed the moments with Holland outside of the costume about as much as I did with him swinging around and kicking ass which is something that actors struggled with in the past. This new Spider-Man isn&#8217;t on screen enough to distract you from the overall progression of the narrative but he certainly left me wanting for more.<\/p> <h2>The Bad<\/h2><p>This is not a <em>true<\/em> Captain America movie. No, this is most certainly an Avengers movie with slightly more screen time devoted to Chris Evans&#8217; character than some of the others. Seriously, you can easily call this &#8220;Avengers 2.5&#8221; or &#8220;Iron Man 4&#8221; or &#8220;Marvel: Civil War&#8221; with little to no impact or viewer confusion. Captain America has been my favorite character in the Marvel cinematic universe and while there are a few moments dedicated to the character and his adaptation with today&#8217;s world but they&#8217;re few and far between. You won&#8217;t see the same level of character advancement as we&#8217;d seen in &#8220;The Winter Soldier&#8221; and while there are a few key moments they don&#8217;t really give us much time with the title character.<\/p><p><a href=\"http:\/\/www.themovieblog.com\/2016\/ant-man-meets-captain-america-in-this-cool-new-clip\/captain-america-civil-war-1\/\" rel=\"attachment wp-att-935879\"><img class=\"alignleft size-thumbnail wp-image-935879\" src=\"http:\/\/themovieblog.com\/wp-content\/uploads\/2016\/04\/Captain-America-Civil-War-1-291x161.jpg\" alt=\"Captain-America-Civil-War-1\" width=\"291\" height=\"161\" \/><\/a><\/p><p>So. Many. Characters. Seriously, we bounce around characters with so many different individual arcs that it&#8217;s practically impossible to recommend this film to folks who are new to the Marvel world of films. It&#8217;s certainly possible for new fans to just jump in and enjoy the ride but they will certainly ping their more experienced friends with questions shortly after. There are over 10 Avengers in this movie, a few solo acts, and more. This movie has everything and everyone not named Hulk or Thor and that&#8217;s a bit much to follow since some characters seem shoe horned in for the sake of appearance. Specifically Ant-Man, Spider-Man, Hawkeye, and War Machine&#8217;s all feel like padding. Having this many characters almost seems like a distraction for a story that more intimately revolves around Captain America, Iron Man, Winter Solider, Black Panther, and their issues with one another.<\/p><p>Spider-Man stands out like a sore thumb as someone who doesn&#8217;t need to be there. Spider-Man isn&#8217;t as awkwardly introduced as Ant-Man but both characters seem overtly needless with little interaction between them and pretty much anyone else in the movie. Although their appearances do complement the on-screen action scenes both characters could have been omitted out of the movie entirely without much, if any, detriment to the overall narrative.<\/p><h2>Overall:<\/h2><p>Smart, emotional film. This one takes a look at the heroes from the layman&#8217;s perspective and it&#8217;s not a pretty view. This isn&#8217;t a film with a traditional threat or single villain that needs to be overcome. This is a story about guys who passionately disagree with one another and their inability to agree on the response to certain issues leads to conflict and war. I love the way this movie managed to introduce and setup future Marvel films without seeming like too much of a distraction to the overall film. I love Spider-Man&#8217;s quips and comments while meeting the other heroes. I love the way Black Panther does not have time for anyone&#8217;s shit and refuses to quip! He&#8217;s a man on a mission and carries himself in a cool, calm, regal, and charming way that makes a stark contrast to characters we&#8217;ve seen in the past.<\/p>"
  },
  {
    "id": 2,
    "author": "dgardner1",
    "avatar": "https://angular.io/resources/images/bios/jelbourn.jpg",
    "title": "“The Invitation”: Catharsis and Chaos Over Dinner",
    "gender": "Female",
    "publishedDate": "2016-02-11T07:25:57Z",
    "likes": 752,
    "starts": 3,
    "abstract": "What begins as an emotional exploration of coming to terms with unbearable loss evolves into something even more decidedly dark in the psychological thriller “The Invitation”.Logan Marshall-Green (“Prometheus”, “As I Lay Dying”) is Will, who along with his girlfriend accepts a request to attend a dinner party among old friends hosted by his ex-wife and her new husband at the home the former spouses once used to share. The couple’s devastatingly tragic past is gradually divulged, soon after which all hell breaks loose in and around the ostentatious house and grounds.",
    "images": [      "http://themovieblog.com/wp-content/uploads/2016/04/MV5BMTkzODMwNDkzOF5BMl5BanBnXkFtZTgwNDA4NzA1ODE@._V1_SY1000_CR006871000_AL_-687x440.jpg", 
        "http://www.themovieblog.com/2016/the-invitation-catharsis-and-chaos-over-dinner/the-invitation_argument/"
    ] 
  },
  {
    "id": 3,
    "author": "jthompson2",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Review: “Southpaw” shows Gyllenhaal Delivering A Knockout Oscar Punch",
    "gender": "Male",
    "publishedDate": "2015-09-17T00:20:37Z",
    "likes": 922,
    "starts": 5,
    "abstract": "If Jake Gyllenhaal hasn’t announced his that he’s one of the top ten actors in Hollywood with his performances in End of Watch, Prisoners, and Nightcrawler, he certainly just did in Southpaw. In a performance that is sure to garner a Oscar nomination for his leading role, Gyllenhaal transforms himself into a successful, yet damaged boxer Billy Hope.Southpaw follows the story of Billy Hope (Gyllenhaal), a boxer that’s on top of his profession. Right from the start we are introduced to Billy’s heavy hitting skills as he knocks out his opponent to become Light Heavyweight Champion.",
    "images": [      "http://themovieblog.com/wp-content/uploads/2015/07/download.jpeg", 
        "http://themovieblog.com/wp-content/uploads/2015/07/southpaw-poster-594x448.png",
        "http://themovieblog.com/wp-content/uploads/2015/07/southpaw333-v1_vice_670-594x334.jpg"
    ] 
  },
  {
    "id": 4,
    "author": "iharrison3",
    "avatar": "https://angular.io/resources/images/bios/julie-ralph.jpg",
    "title": "Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Nulla dapibus dolor vel est.",
    "gender": "Female",
    "publishedDate": "2016-01-17T15:47:39Z",
    "likes": 501,
    "starts": 1
  },
  {
    "id": 5,
    "author": "bhill4",
    "avatar": "https://angular.io/resources/images/bios/jelbourn.jpg",
    "title": "Maecenas tristique, est et tempus semper, est quam pharetra magna, ac consequat metus sapien ut nunc.",
    "gender": "Male",
    "publishedDate": "2015-10-18T15:55:48Z",
    "likes": 169,
    "starts": 1
  },
  {
    "id": 6,
    "author": "mdiaz5",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Integer pede justo, lacinia eget, tincidunt eget, tempus vel, pede.",
    "gender": "Female",
    "publishedDate": "2015-06-18T21:08:03Z",
    "likes": 236,
    "starts": 1
  },
  {
    "id": 7,
    "author": "jgarrett6",
    "avatar": "https://angular.io/resources/images/bios/julie-ralph.jpg",
    "title": "Aenean fermentum.",
    "gender": "Female",
    "publishedDate": "2015-07-26T10:22:38Z",
    "likes": 447,
    "starts": 3
  },
  {
    "id": 8,
    "author": "jjenkins7",
    "avatar": "https://angular.io/resources/images/bios/jelbourn.jpg",
    "title": "In tempor, turpis nec euismod scelerisque, quam turpis adipiscing lorem, vitae mattis nibh ligula nec sem.",
    "gender": "Female",
    "publishedDate": "2016-04-01T14:11:44Z",
    "likes": 483,
    "starts": 3
  },
  {
    "id": 9,
    "author": "acollins8",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Curabitur gravida nisi at nibh.",
    "gender": "Male",
    "publishedDate": "2016-04-01T16:42:19Z",
    "likes": 898,
    "starts": 1
  },
  {
    "id": 10,
    "author": "rrichardson9",
    "avatar": "https://angular.io/resources/images/bios/julie-ralph.jpg",
    "title": "Morbi odio odio, elementum eu, interdum eu, tincidunt in, leo.",
    "gender": "Female",
    "publishedDate": "2016-05-11T01:09:20Z",
    "likes": 893,
    "starts": 5
  },
  {
    "id": 11,
    "author": "hbowmana",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Aenean auctor gravida sem.",
    "gender": "Male",
    "publishedDate": "2015-11-12T15:45:14Z",
    "likes": 824,
    "starts": 3
  },
  {
    "id": 12,
    "author": "rmillsb",
    "avatar": "https://angular.io/resources/images/bios/jelbourn.jpg",
    "title": "Morbi odio odio, elementum eu, interdum eu, tincidunt in, leo.",
    "gender": "Female",
    "publishedDate": "2016-02-14T12:06:19Z",
    "likes": 208,
    "starts": 4
  },
  {
    "id": 13,
    "author": "sricec",
    "avatar": "https://angular.io/resources/images/bios/julie-ralph.jpg",
    "title": "Donec odio justo, sollicitudin ut, suscipit a, feugiat et, eros.",
    "gender": "Male",
    "publishedDate": "2015-09-27T14:53:52Z",
    "likes": 368,
    "starts": 3
  },
  {
    "id": 14,
    "author": "colsond",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Duis ac nibh.",
    "gender": "Female",
    "publishedDate": "2015-12-11T09:17:46Z",
    "likes": 519,
    "starts": 2
  },
  {
    "id": 15,
    "author": "kjacksone",
    "avatar": "https://angular.io/resources/images/bios/jelbourn.jpg",
    "title": "Morbi sem mauris, laoreet ut, rhoncus aliquet, pulvinar sed, nisl.",
    "gender": "Male",
    "publishedDate": "2016-05-01T05:00:17Z",
    "likes": 611,
    "starts": 2
  },
  {
    "id": 16,
    "author": "kromerof",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "In blandit ultrices enim.",
    "gender": "Male",
    "publishedDate": "2015-06-18T12:10:36Z",
    "likes": 946,
    "starts": 5
  },
  {
    "id": 17,
    "author": "amarting",
    "avatar": "https://angular.io/resources/images/bios/jelbourn.jpg",
    "title": "Etiam justo.",
    "gender": "Male",
    "publishedDate": "2015-08-19T01:49:33Z",
    "likes": 840,
    "starts": 3
  },
  {
    "id": 18,
    "author": "srussellh",
    "avatar": "https://angular.io/resources/images/bios/julie-ralph.jpg",
    "title": "Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Mauris viverra diam vitae quam.",
    "gender": "Female",
    "publishedDate": "2015-11-08T10:37:30Z",
    "likes": 452,
    "starts": 5
  },
  {
    "id": 19,
    "author": "mrobertsoni",
    "avatar": "https://angular.io/resources/images/bios/juleskremer.jpg",
    "title": "Maecenas ut massa quis augue luctus tincidunt.",
    "gender": "Female",
    "publishedDate": "2015-09-15T06:59:03Z",
    "likes": 312,
    "starts": 5
  },
  {
    "id": 20,
    "author": "mgutierrezj",
    "avatar": "https://angular.io/resources/images/bios/julie-ralph.jpg",
    "title": "Maecenas tristique, est et tempus semper, est quam pharetra magna, ac consequat metus sapien ut nunc.",
    "gender": "Female",
    "publishedDate": "2016-01-28T08:12:51Z",
    "likes": 394,
    "starts": 1
  }
]